app/controllers/admin/manufacturer_controller.rb

UPDATE `manufacturers` SET `name` = 'OtroNombre', `updated_at` = '2015-04-27 18:17:32' WHERE `manufacturers`.`id` = 1
---
  def update
    @manufacturer = Manufacturer.find(params[:id])
    if @manufacturer.update_attributes(manufacturer_params)