app/controllers/admin/manufacturer_controller.rb

INSERT INTO `manufacturers` (`created_at`, `name`, `telephone`, `updated_at`) VALUES ('2015-03-24 09:50:49', 'Kevin', '555', '2015-03-24 09:50:49')
---
  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save

SELECT  `manufacturers`.* FROM `manufacturers`  WHERE `manufacturers`.`id` = 1 LIMIT 1
---
  def edit
    @manufacturer = Manufacturer.find(params[:id])

SELECT  `manufacturers`.* FROM `manufacturers`  WHERE `manufacturers`.`id` = 1 LIMIT 1
UPDATE `manufacturers` SET `telephone` = '5553', `updated_at` = '2015-03-24 09:54:08' WHERE `manufacturers`.`id` = 1
---
  def update
    @manufacturer = Manufacturer.find(params[:id])
    if @manufacturer.update_attributes(manufacturer_params)

SELECT  `manufacturers`.* FROM `manufacturers`  WHERE `manufacturers`.`id` = 1 LIMIT 1
DELETE FROM `manufacturers` WHERE `manufacturers`.`id` = 1
---
  def destroy
    @manufacturer = Manufacturer.find(params[:id])
    @manufacturer.destroy

SELECT  `manufacturers`.* FROM `manufacturers`  WHERE `manufacturers`.`id` = 1 LIMIT 1
---
  def show
    @manufacturer = Manufacturer.find(params[:id])

SELECT `manufacturers`.* FROM `manufacturers`
---
  def index
    @manufacturers = Manufacturer.all