app/controllers/admin/tshirt_controller.rb

UPDATE `tshirts` SET `club` = 'Barcelona', `price` = 10.5, `size` = 'L' WHERE `tshirts`.`id` = 12
---
  def update
    @tshirt = Tshirt.find(params[:id])
    if @tshirt.update_attributes(tshirt_params)