app/controllers/admin/tshirt_controller.rb

INSERT INTO `tshirts` (`club`, `country`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `manufacturer_id`, `price`, `size`) VALUES ('9', '9', 'image/jpeg', '7.jpg', 67210, '2015-04-27 13:38:51', 1, 9.0, '9')
---
  def create
    @tshirt = Tshirt.new(tshirt_params)
    if @tshirt.save

SELECT  `tshirts`.* FROM `tshirts`  WHERE `tshirts`.`id` = 1 LIMIT 1
---
  def edit
    load_data
    @tshirt = Tshirt.find(params[:id])

SELECT  `tshirts`.* FROM `tshirts`  WHERE `tshirts`.`id` = 1 LIMIT 1
UPDATE `tshirts` SET `manufacturer_id` = 2 WHERE `tshirts`.`id` = 3
---
  def update
    @tshirt = Tshirt.find(params[:id])
    if @tshirt.update_attributes(tshirt_params)

SELECT  `tshirts`.* FROM `tshirts`  WHERE `tshirts`.`id` = 1 LIMIT 1
DELETE FROM `tshirts` WHERE `tshirts`.`id` = 1
---
  def destroy
    @tshirt = Tshirt.find(params[:id])
    @tshirt.destroy

SELECT  `tshirts`.* FROM `tshirts`  WHERE `tshirts`.`id` = 1 LIMIT 1
---
  def show
    load_data
    @tshirt = Tshirt.find(params[:id])

SELECT `tshirts`.* FROM `tshirts`
---
  def index
    @tshirts = Tshirt.all

SELECT `manufacturers`.* FROM `manufacturers`
---
    def load_data
    @manufacturers = Manufacturer.all