app/controllers/cart_controller.rb

  def add
  	@tshirt = Tshirt.find params[:id]
---
SELECT  `tshirts`.* FROM `tshirts`  WHERE `tshirts`.`id` = 4 LIMIT 1

  def remove
    @tshirt = Tshirt.find params[:id]
---
SELECT  `tshirts`.* FROM `tshirts`  WHERE `tshirts`.`id` = 4 LIMIT 1

  def clear
  	@page_title = 'Clear cart'
    if request.post?
      @cart.cart_items.destroy_all
---
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 1