app/controllers/catalog_controller.rb

  def show
    @tshirt = Tshirt.find(params[:id])
---
SELECT  `tshirts`.* FROM `tshirts`  WHERE `tshirts`.`id` = 6 LIMIT 1

  def index
    @tshirts = Tshirt.order("tshirts.id desc").includes(:manufacturer).paginate(:page => params[:page], :per_page => 5)
---
SELECT  `tshirts`.* FROM `tshirts`   ORDER BY tshirts.id desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tshirts`
SELECT `manufacturers`.* FROM `manufacturers`  WHERE `manufacturers`.`id` IN (1, 2)