app/controllers/checkout_controller.rb

SELECT  1 AS one FROM `tshirts` INNER JOIN `cart_items` ON `tshirts`.`id` = `cart_items`.`tshirt_id` WHERE `cart_items`.`cart_id` = 980190963 LIMIT 1
---
  def index
    @order = Order.new
    @page_title = 'Checkout'
    if @cart.tshirts.empty?

SELECT  `carts`.* FROM `carts`  WHERE `carts`.`id` = 980190987 LIMIT 1
INSERT INTO `orders` (`created_at`, `customer_ip`, `email`, `phone_number`, `ship_to_address`, `ship_to_city`, `ship_to_country_code`, `ship_to_first_name`, `ship_to_last_name`, `ship_to_postal_code`, `status`, `updated_at`) VALUES ('2015-06-01 17:11:02', '127.0.0.1', 'kevin@email.com', '123456789', 'Calle del Campo', 'Paterna', 'SPAIN', 'Troli', 'Perez', '123456', 'open', '2015-06-01 17:11:02')
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 980190991
---
  def submit_order
    @cart = Cart.find(params[:cart][:id]) # Search the cart from the cart id hidden field of the form
    @order = Order.new(order_params)
    @order.ship_to_country_code = @order.ship_to_country_code.upcase
    @order.customer_ip = request.remote_ip
    @order.status = 'open'
    @page_title = 'Checkout'
    populate_order

    if @order.save
      if @order.process
        flash[:notice] = 'Your order has been submitted and will be processed inmediately.'
        session[:order_id] = @order.id
        @cart.cart_items.destroy_all # empty shopping cart