app/controllers/user_controller.rb

  def new
    @user = User.new
    @page_title = 'Create new account'
    if current_user
      flash[:notice] = 'Only one account can be created.'
      redirect_to :controller => 'about', :action => 'index'
    else
      # only when there are no accounts it allows to create a new one, unique in the system
      redirect_to :controller => 'user_sessions', :action => 'new' unless User.count == 0
---
SELECT COUNT(*) FROM `users`

  def create
    @user = User.new(user_params)
    if @user.save # the new user has been logged in automatically
---
INSERT INTO `users` (`created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `last_request_at`, `login`, `login_count`, `name`, `password_salt`, `perishable_token`, `persistence_token`, `updated_at`) VALUES ('2015-05-18 18:02:48', '0925368cde319c9196ec774d21cdccd00b6f22c2df9124801edb4b080061894a2d04a199c56301cfc364ba3397d04a3e6abb1ec9629743b24fe2374cb86b5f8a', '2015-05-18 18:02:48', '127.0.0.1', 'kevin@emporium.com', '2015-05-18 18:02:48', 'kevin', 1, 'Kevin Valle', 'UNl1D9phKWwXtPZhqCB', 'dfhqghTTbzblsoywX4Jq', '70ed056cb1695ebade115d66515747f278954123d5c0689aaab711bd95ccf76693a511b111c8488245e82f587e513f5c2d091407942296236abb11fec7dbfa44', '2015-05-18 18:02:48')

  def update
    @user = current_user
    if @user.update_attributes(user_params)
---
UPDATE `users` SET `crypted_password` = '0caa4cc3131662d5aab5cc3f9b6bfa59f3e0f8c5bca073016090cbaa843eebed18b871acfb186a7e480ceddbe6b321984b1649ae0ccfb955242f58c2b4897691', `current_login_at` = '2015-05-18 18:02:49', `last_login_at` = '2015-05-18 18:02:48', `last_login_ip` = '127.0.0.1', `last_request_at` = '2015-05-18 18:02:49', `login_count` = 2, `password_salt` = 'kYvzyQ4biAhVlvNHdjJ', `perishable_token` = 'bzSZg284GN8SXLSsorO', `persistence_token` = 'aff99c82858cffc37d5c8b08ebf2e4e29fd92223cfa160165f6074e60b97e424958589491546a05b732c537f6cfa655498a9a5e62ac4b4a706b248faf4e1a005', `updated_at` = '2015-05-18 18:02:49' WHERE `users`.`id` = 1